app/Models/ModelKasMasjid.php

SELECT *
FROM `tbl_kas_masjid`
---
    public function getKasmasjid()
    {
        $builder = $this->db->table('tbl_kas_masjid');
        return $builder->get();

SELECT *
FROM `tbl_donatur`
---
    public function getDonatur()
    {
        $builder = $this->db->table('tbl_donatur');
        return $builder->get();

INSERT INTO `tbl_kas_masjid` (`tanggal`, `ket`, `kas_masuk`, `jenis_kas`, `iddonaturmasjid`) VALUES ('2024-01-25', 'Dari Ketua', '500000', 'sosial', 'D001')
---
    public function insertData($data)
    {
        $this->db->table('tbl_kas_masjid')->insert($data);

DELETE FROM `tbl_kas_masjid`
WHERE `id_kas_masjid` = '30'
---
    public function deletekasmasjid($id)
    {
        $query = $this->db->table('tbl_kas_masjid')->delete(array('id_kas_masjid' => $id));