app/Models/ModelKasKeluar1.php

SELECT *
FROM `tbl_kas_keluar`
JOIN `tbl_agenda` ON `id_agendamasjid`=`id_agenda`
WHERE `jenis_kas` = "Anak Yatim"
---
    public function getKaskeluaranakyatim()
    {
        $builder = $this->db->table('tbl_kas_keluar')->join('tbl_agenda', 'id_agendamasjid=id_agenda')
            ->where('jenis_kas="Anak Yatim"');
        return $builder->get();

SELECT *
FROM `tbl_agenda`
WHERE `jenis_agenda` = "Anak Yatim"
---
    public function getAgendaanakyatim()
    {
        $builder = $this->db->table('tbl_agenda')->where('jenis_agenda="Anak Yatim"');
        return $builder->get();